packaging.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-16 Mon 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Packaging material</title>
<meta name="author" content="Nathan Stonewall" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Packaging material</h1>
<p>
 <br>
</p>
<div id="outline-container-orgf3c801e" class="outline-2">
<h2 id="orgf3c801e"><b>Option A</b></h2>
<div class="outline-text-2" id="text-orgf3c801e">
<p>
<i>Note: Options are rendered as XML, but UI representation should be similar.</i>
</p>

<p>
1 <code>PackagingMaterial</code> parent class, 1 child <code>PackagingRawMaterialInformation</code> class
</p>
</div>
<ul class="org-ul">
<li><a id="org1ebd1bb"></a>Example<br />
<div class="outline-text-4" id="text-org1ebd1bb">
<div class="org-src-container">
<pre class="src src-xml">    &lt;<span style="color: #82aaff;">packagingMaterialTypeCode</span>&gt;POLYMER_PP&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingMaterialCompositionQuantity</span>&gt;10&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingMaterialColourCodeReference</span>&gt;BLK&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingLabellingTypeCode</span>&gt;Label on package&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingLabellingCoveragePercentage</span>&gt;60&lt;/&gt;
    &lt;<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;
      &lt;<span style="color: #82aaff;">packagingRawMaterialCode</span>&gt;Crude oil&lt;/&gt;
      &lt;<span style="color: #82aaff;">packagingRawMaterialPercentage</span>&gt;40&lt;/&gt;
      &lt;<span style="color: #82aaff;">packagingRawMaterialCode</span>&gt;Recycled&lt;/&gt;
      &lt;<span style="color: #82aaff;">packagingRawMaterialPercentage</span>&gt;60&lt;/&gt;
    &lt;/<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;
</pre>
</div>
</div>
</li>
<li><a id="orgaaddaeb"></a>Effects<br />
<ul class="org-ul">
<li><a id="orgae40d62"></a>Possible to send one <code>packagingMaterialTypeCode</code> with &gt;1 <code>packagingRawMaterialCode</code> .<br /></li>
<li><a id="org01f5775"></a>Not possible to send above with &gt;1 color.<br /></li>
<li><a id="org6b06483"></a>1 <code>packagingMaterialTypeCode</code> instance = 1 <code>packagingMaterialColourCodeReference</code> instance.<br />
<div class="outline-text-6" id="text-org6b06483">
<p>
 <br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org108567c" class="outline-2">
<h2 id="org108567c"><b>Option B</b></h2>
<div class="outline-text-2" id="text-org108567c">
<p>
2 <code>PackagingMaterial</code> parent classes, each with respective <code>PackagingRawMaterialInformation</code> child class
</p>
</div>
<ul class="org-ul">
<li><a id="orged3d2e4"></a>Example<br />
<div class="outline-text-4" id="text-orged3d2e4">
<div class="org-src-container">
<pre class="src src-xml">    &lt;<span style="color: #82aaff;">packagingMaterialTypeCode</span>&gt;POLYMER_PP&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingMaterialCompositionQuantity</span>&gt;10&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingMaterialcolourCodeReference</span>&gt;BLK&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingLabellingTypeCode</span>&gt;Label on package&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingLabellingCoveragePercentage</span>&gt;60&lt;/&gt;
    &lt;<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;
      &lt;<span style="color: #82aaff;">packagingRawMaterialCode</span>&gt;Crude oil&lt;/&gt;
      &lt;<span style="color: #82aaff;">packagingRawMaterialPercentage</span>&gt;40&lt;/&gt;
    &lt;/<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;

    &lt;<span style="color: #82aaff;">packagingMaterialTypeCode</span>&gt;POLYMER_PP&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingMaterialCompositionQuantity</span>&gt;10&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingMaterialcolourCodeReference</span>&gt;CLEAR&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingLabellingTypeCode</span>&gt;Label on package&lt;/&gt;
    &lt;<span style="color: #82aaff;">packagingLabellingCoveragePercentage</span>&gt;60&lt;/&gt;
    &lt;<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;
      &lt;<span style="color: #82aaff;">packagingRawMaterialCode</span>&gt;Recycled&lt;/&gt;
      &lt;<span style="color: #82aaff;">packagingRawMaterialPercentage</span>&gt;60&lt;/&gt;
    &lt;/<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;
</pre>
</div>
</div>
</li>
<li><a id="orga0a1ebf"></a>Effects<br />
<ul class="org-ul">
<li><a id="orgcf3341c"></a>Single material is misrepresented as two separate materials.<br /></li>
<li><a id="orge7787cd"></a>Real weight is misrepresented as two weights<br />
<ul class="org-ul">
<li><a id="org6c39b30"></a>And must be, since <code>packagingMaterialCompositionQuantity</code> is mandatory.<br /></li>
</ul>
</li>
<li><a id="org2e4a43b"></a>Redundant repetition of e.g. weight, labelling information.<br />
<ul class="org-ul">
<li><a id="org699f9e5"></a>This could tell a system that they refer to one and the same packaging element.<br />
<div class="outline-text-7" id="text-org699f9e5">
<p>
 <br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgc8f5ac6" class="outline-2">
<h2 id="orgc8f5ac6"><b>Option C</b></h2>
<div class="outline-text-2" id="text-orgc8f5ac6">
<p>
1 <code>PackagingMaterial</code> parent class, 2 child <code>CompositeMaterialDetail</code> classes, each with respective child <code>PackagingRawMaterialInformation</code> class
</p>
</div>
<ul class="org-ul">
<li><a id="org66ab576"></a>Example<br />
<div class="outline-text-4" id="text-org66ab576">
<div class="org-src-container">
<pre class="src src-xml">  &lt;<span style="color: #82aaff;">packagingMaterialTypeCode</span>&gt;COMPOSITE&lt;/&gt;
  &lt;<span style="color: #82aaff;">packagingMaterialCompositionQuantity</span>&gt;10&lt;/&gt;
  &lt;<span style="color: #82aaff;">packagingLabellingTypeCode</span>&gt;Label on packaging&lt;/&gt;
  &lt;<span style="color: #82aaff;">packagingLabellingCoveragePercentage</span>&gt;60&lt;/&gt;

  &lt;<span style="color: #82aaff;">CompositeMaterialDetail</span>&gt;
    &lt;<span style="color: #82aaff;">packagingMaterialTypeCode</span>&gt;POLYMER_PP&lt;/&gt;
    <span style="color: #626262;">&lt;!-- </span><span style="color: #626262;">&lt;packagingMaterialCompositionQuantity&gt;10&lt;/&gt;</span><span style="color: #626262;"> --&gt;</span>
    &lt;<span style="color: #82aaff;">packagingMaterialColorCodeReference</span>&gt;BLK&lt;/&gt;
      &lt;<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;
        &lt;<span style="color: #82aaff;">packagingRawMaterialCode</span>&gt;Crude oil&lt;/&gt;
        &lt;<span style="color: #82aaff;">packagingRawMaterialPercentage</span>&gt;40&lt;/&gt;
      &lt;/<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;
  &lt;/<span style="color: #82aaff;">CompositeMaterialDetail</span>&gt;
  &lt;<span style="color: #82aaff;">CompositeMaterialDetail</span>&gt;
    &lt;<span style="color: #82aaff;">packagingMaterialTypeCode</span>&gt;POLYMER_PP&lt;/&gt;
    <span style="color: #626262;">&lt;!-- </span><span style="color: #626262;">&lt;packagingMaterialCompositionQuantity&gt;10&lt;/&gt;</span><span style="color: #626262;"> --&gt;</span>
    &lt;<span style="color: #82aaff;">packagingMaterialColorCodeReference</span>&gt;CLEAR&lt;/&gt;
      &lt;<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;
        &lt;<span style="color: #82aaff;">packagingRawMaterialCode</span>&gt;Recycled&lt;/&gt;
        &lt;<span style="color: #82aaff;">packagingRawMaterialPercentage</span>&gt;60&lt;/&gt;
      &lt;/<span style="color: #82aaff;">PackagingRawMaterialInformation</span>&gt;
  &lt;/<span style="color: #82aaff;">CompositeMaterialDetail</span>&gt;
</pre>
</div>
</div>
</li>
<li><a id="org6ae86cc"></a>Effects<br />
<ul class="org-ul">
<li><a id="orgb208e90"></a>The most expressive solution, but &#x2026;<br /></li>
<li><a id="org0ef41e6"></a>Same <code>packagingMaterialTypeCode</code> must be populated for each composite material<br />
<ul class="org-ul">
<li><a id="org76d4542"></a>This could tell a system that they refer to one and the same packaging element.<br /></li>
</ul>
</li>
<li><a id="orgd61bef0"></a><code>packagingMaterialCompositionQuantity</code> (weight) need not be filled in for each composite material since VR 1025 does not apply.<br /></li>
<li><a id="org364fbf0"></a><code>CompositeMaterialDetail</code> class will need to be brought into Swedish TII.<br />
<div class="outline-text-6" id="text-org364fbf0">
<p>
 <br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org3d4e84c" class="outline-2">
<h2 id="org3d4e84c">General comments</h2>
<div class="outline-text-2" id="text-org3d4e84c">
</div>
<ul class="org-ul">
<li><a id="org5671b72"></a>As long as ICA and supplier understand one another, no one necessarily needs to do anything.<br /></li>
<li><a id="orgef56938"></a>But difficult to make recommendations without knowing final overall requirements.<br /></li>
</ul>
</div>
<div id="outline-container-orgb0eb3b3" class="outline-2">
<h2 id="orgb0eb3b3">Tips for UI and system architecture</h2>
<div class="outline-text-2" id="text-orgb0eb3b3">
</div>
<ul class="org-ul">
<li><a id="org4f22a5d"></a>Build your UI as close to XML schema as possible.<br /></li>
<li><a id="org879b34f"></a>Do not abstract away details merely because they do not seem needed today.<br /></li>
<li><a id="orgebf6f2d"></a>If schema does not allow you to express what you want to express, either:<br />
<div class="outline-text-4" id="text-orgebf6f2d">
<ol class="org-ol">
<li>It can be modified
<ul class="org-ul">
<li>Requires broad agreement in all of GDSN</li>
</ul></li>
<li><b><span class="underline">It can be worked around in your own system(s)</span></b> by:
<ul class="org-ul">
<li>Having involved parties agree on how to do things</li>
<li>Based on these agreements, applying the appropriate logic in your systems.</li>
</ul></li>
</ol>


<p>
 <br>
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-10-13 Fri 00:00</p>
<p class="author">Author: Nathan Stonewall</p>
<p class="date">Created: 2023-10-16 Mon 09:59</p>
</div>
</body>
</html>